zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/ke1xz/pinctrl/MKE12Z256VLL7-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE12Z256VLL7/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKE17Z512VLH9-pinctrl.h with this part's differences applied
 * below (77 removed, 0 changed,
 * 105 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 0fc67e9e7f61f0e4
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE12Z256VLL7_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKE12Z256VLL7_WRAPPER_

#include "MKE17Z512VLH9-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_SE16_PTC15
#undef ADC0_SE17_PTC14
#undef ADC0_SE18_PTB3
#undef ADC0_SE19_PTB2
#undef ADC0_SE20_PTB1
#undef ADC0_SE21_PTB0
#undef ADC0_SE22_PTC9
#undef ADC0_SE24_PTC8
#undef LPI2C1_HREQ_PTC5
#undef LPI2C1_SCLS_PTA13
#undef LPI2C1_SCLS_PTC17
#undef LPI2C1_SCL_PTE1
#undef LPI2C1_SDAS_PTA12
#undef LPI2C1_SDAS_PTC16
#undef LPI2C1_SDA_PTE0
#undef LPSPI1_PCS0_PTD3
#undef LPSPI1_PCS1_PTA6
#undef LPSPI1_SCK_PTD0
#undef LPSPI1_SIN_PTD1
#undef LPSPI1_SOUT_PTD2
#undef RTC_CLKIN_PTA7
#undef RTC_CLKOUT_PTC5
#undef SCI0_RX_PTC0
#undef SCI0_RX_PTC14
#undef SCI0_TX_PTC1
#undef SCI0_TX_PTC15
#undef SCI1_RX_PTB12
#undef SCI1_RX_PTC16
#undef SCI1_TX_PTB13
#undef SCI1_TX_PTC17
#undef TSI0_CH0_PTE6
#undef TSI0_CH10_PTE10
#undef TSI0_CH11_PTD1
#undef TSI0_CH12_PTD0
#undef TSI0_CH16_PTE5
#undef TSI0_CH17_PTE4
#undef TSI0_CH18_PTE3
#undef TSI0_CH19_PTD16
#undef TSI0_CH1_PTE2
#undef TSI0_CH20_PTD15
#undef TSI0_CH21_PTE9
#undef TSI0_CH22_PTE8
#undef TSI0_CH23_PTB5
#undef TSI0_CH24_PTB4
#undef TSI0_CH2_PTA13
#undef TSI0_CH3_PTA12
#undef TSI0_CH4_PTA11
#undef TSI0_CH5_PTA10
#undef TSI0_CH6_PTE1
#undef TSI0_CH7_PTE0
#undef TSI0_CH8_PTC5
#undef TSI0_CH9_PTE11
#undef TSI1_CH0_PTC6
#undef TSI1_CH10_PTE7
#undef TSI1_CH11_PTA6
#undef TSI1_CH12_PTA7
#undef TSI1_CH13_PTC8
#undef TSI1_CH14_PTC9
#undef TSI1_CH15_PTB0
#undef TSI1_CH16_PTB1
#undef TSI1_CH17_PTB2
#undef TSI1_CH18_PTB3
#undef TSI1_CH19_PTC14
#undef TSI1_CH1_PTC7
#undef TSI1_CH20_PTC15
#undef TSI1_CH21_PTC16
#undef TSI1_CH22_PTC17
#undef TSI1_CH23_PTC0
#undef TSI1_CH24_PTC1
#undef TSI1_CH2_PTA0
#undef TSI1_CH3_PTA1
#undef TSI1_CH4_PTA2
#undef TSI1_CH5_PTA3
#undef TSI1_CH6_PTD2
#undef TSI1_CH7_PTD4
#undef TSI1_CH8_PTB12
#undef TSI1_CH9_PTB13

/* Signals specific to this part */
#define BUSOUT_PTA14 KINETIS_MUX('A',14,7)
#define CLKOUT_PTD14 KINETIS_MUX('D',14,7)
#define EWM_IN_PTA14 KINETIS_MUX('A',14,4)
#define EWM_OUT_b_PTA17 KINETIS_MUX('A',17,4)
#define FTM0_CH0_PTB10 KINETIS_MUX('B',10,2)
#define FTM0_CH1_PTB11 KINETIS_MUX('B',11,2)
#define FTM0_CH2_PTB14 KINETIS_MUX('B',14,2)
#define FTM0_CH3_PTB15 KINETIS_MUX('B',15,2)
#define FTM0_CH4_PTB16 KINETIS_MUX('B',16,2)
#define FTM0_CH5_PTB17 KINETIS_MUX('B',17,2)
#define FTM0_CH6_PTA17 KINETIS_MUX('A',17,2)
#define FTM0_CH7_PTD8 KINETIS_MUX('D',8,2)
#define FTM0_FLT0/TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,2)
#define FTM0_FLT0_PTA14 KINETIS_MUX('A',14,2)
#define FTM0_FLT1_PTE14 KINETIS_MUX('E',14,2)
#define FTM0_FLT2_PTD17 KINETIS_MUX('D',17,2)
#define FTM0_FLT3_PTE12 KINETIS_MUX('E',12,2)
#define FTM1_CH2_PTA15 KINETIS_MUX('A',15,2)
#define FTM1_CH3_PTA16 KINETIS_MUX('A',16,2)
#define FTM2_CH0_PTD10 KINETIS_MUX('D',10,2)
#define FTM2_CH1_PTD11 KINETIS_MUX('D',11,2)
#define FTM2_CH2_PTD12 KINETIS_MUX('D',12,2)
#define FXIO_D0_PTB10 KINETIS_MUX('B',10,6)
#define FXIO_D1_PTB11 KINETIS_MUX('B',11,6)
#define FXIO_D2_PTD9 KINETIS_MUX('D',9,6)
#define FXIO_D2_PTE15 KINETIS_MUX('E',15,6)
#define FXIO_D3_PTE16 KINETIS_MUX('E',16,6)
#define FXIO_D4_PTB8 KINETIS_MUX('B',8,6)
#define FXIO_D5_PTB9 KINETIS_MUX('B',9,6)
#define FXIO_D6_PTA8 KINETIS_MUX('A',8,4)
#define FXIO_D7_PTA9 KINETIS_MUX('A',9,4)
#define LPI2C0_HREQ_PTB11 KINETIS_MUX('B',11,3)
#define LPI2C0_SCLS_PTB9 KINETIS_MUX('B',9,3)
#define LPI2C0_SCL_PTB8 KINETIS_MUX('B',8,4)
#define LPI2C0_SDAS_PTB10 KINETIS_MUX('B',10,3)
#define LPI2C0_SDA_PTA16 KINETIS_MUX('A',16,4)
#define LPSPI0_PCS0_PTC13 KINETIS_MUX('C',13,5)
#define LPSPI0_PCS1_PTD8 KINETIS_MUX('D',8,5)
#define LPSPI0_PCS3_PTA15 KINETIS_MUX('A',15,3)
#define LPSPI0_SCK_PTC10 KINETIS_MUX('C',10,5)
#define LPSPI0_SIN_PTC11 KINETIS_MUX('C',11,5)
#define LPSPI0_SOUT_PTC12 KINETIS_MUX('C',12,5)
#define LPUART1_RX_PTD13 KINETIS_MUX('D',13,3)
#define LPUART1_TX_PTD14 KINETIS_MUX('D',14,3)
#define LPUART2_CTS_PTD11 KINETIS_MUX('D',11,6)
#define LPUART2_RTS_PTD12 KINETIS_MUX('D',12,6)
#define LPUART2_RX_PTD17 KINETIS_MUX('D',17,3)
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3)
#define PTA14 KINETIS_MUX('A',14,1)
#define PTA15 KINETIS_MUX('A',15,1)
#define PTA16 KINETIS_MUX('A',16,1)
#define PTA17 KINETIS_MUX('A',17,1)
#define PTA8 KINETIS_MUX('A',8,1)
#define PTA9 KINETIS_MUX('A',9,1)
#define PTB10 KINETIS_MUX('B',10,1)
#define PTB11 KINETIS_MUX('B',11,1)
#define PTB14 KINETIS_MUX('B',14,1)
#define PTB15 KINETIS_MUX('B',15,1)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB8 KINETIS_MUX('B',8,1)
#define PTB9 KINETIS_MUX('B',9,1)
#define PTC10 KINETIS_MUX('C',10,1)
#define PTC11 KINETIS_MUX('C',11,1)
#define PTC12 KINETIS_MUX('C',12,1)
#define PTC13 KINETIS_MUX('C',13,1)
#define PTD10 KINETIS_MUX('D',10,1)
#define PTD11 KINETIS_MUX('D',11,1)
#define PTD12 KINETIS_MUX('D',12,1)
#define PTD13 KINETIS_MUX('D',13,1)
#define PTD14 KINETIS_MUX('D',14,1)
#define PTD17 KINETIS_MUX('D',17,1)
#define PTD8 KINETIS_MUX('D',8,1)
#define PTD9 KINETIS_MUX('D',9,1)
#define PTE12 KINETIS_MUX('E',12,1)
#define PTE13 KINETIS_MUX('E',13,1)
#define PTE14 KINETIS_MUX('E',14,1)
#define PTE15 KINETIS_MUX('E',15,1)
#define PTE16 KINETIS_MUX('E',16,1)
#define TRGMUX_IN4_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3 KINETIS_MUX('D',3,6)
#define TRGMUX_IN5_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2 KINETIS_MUX('D',2,6)
#define TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,6)
#define TRGMUX_IN7_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5 KINETIS_MUX('D',5,6)
#define TRGMUX_OUT0_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1 KINETIS_MUX('A',1,7)
#define TRGMUX_OUT0_PTA8 KINETIS_MUX('A',8,7)
#define TRGMUX_OUT0_PTA8_PTA8_PTA8_PTA8_PTA8_PTA8_PTA8_PTA8 KINETIS_MUX('A',8,7)
#define TRGMUX_OUT1_PTA9 KINETIS_MUX('A',9,7)
#define TRGMUX_OUT1_PTA9_PTA9_PTA9_PTA9_PTA9_PTA9_PTA9_PTA9 KINETIS_MUX('A',9,7)
#define TRGMUX_OUT1_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0 KINETIS_MUX('D',0,7)
#define TRGMUX_OUT2_PTD17 KINETIS_MUX('D',17,7)
#define TRGMUX_OUT2_PTD17_PTD17_PTD17_PTD17_PTD17_PTD17_PTD17_PTD17 KINETIS_MUX('D',17,7)
#define TRGMUX_OUT2_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1 KINETIS_MUX('D',1,7)
#define TRGMUX_OUT3_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0 KINETIS_MUX('A',0,7)
#define TRGMUX_OUT3_PTE12 KINETIS_MUX('E',12,7)
#define TRGMUX_OUT3_PTE12_PTE12_PTE12_PTE12_PTE12_PTE12_PTE12_PTE12 KINETIS_MUX('E',12,7)
#define TRGMUX_OUT4_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10 KINETIS_MUX('E',10,7)
#define TRGMUX_OUT4_PTE14 KINETIS_MUX('E',14,7)
#define TRGMUX_OUT4_PTE14_PTE14_PTE14_PTE14_PTE14_PTE14_PTE14_PTE14 KINETIS_MUX('E',14,7)
#define TRGMUX_OUT5_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11 KINETIS_MUX('E',11,7)
#define TRGMUX_OUT5_PTE13 KINETIS_MUX('E',13,7)
#define TRGMUX_OUT5_PTE13_PTE13_PTE13_PTE13_PTE13_PTE13_PTE13_PTE13 KINETIS_MUX('E',13,7)
#define TRGMUX_OUT6_PTE15 KINETIS_MUX('E',15,7)
#define TRGMUX_OUT6_PTE15_PTE15_PTE15_PTE15_PTE15_PTE15_PTE15_PTE15 KINETIS_MUX('E',15,7)
#define TRGMUX_OUT7_PTE16 KINETIS_MUX('E',16,7)
#define TRGMUX_OUT7_PTE16_PTE16_PTE16_PTE16_PTE16_PTE16_PTE16_PTE16 KINETIS_MUX('E',16,7)

#endif /* _ZEPHYR_DTS_BINDING_MKE12Z256VLL7_WRAPPER_ */
